Repository: Leer/data.table
Catalog: po/R-*.po
Languages: ru_ru

source: should be <= corresponding entries in column
ru_ru: должны быть <= соответствующим значениям в столбце

source: in data.table 'x'.
ru_ru: в data.table-таблице `x`.

source: NA values in data.table 'y' start column: '
ru_ru: В data.table-таблице 'y' встречаются NA-значения в начале столбца:

source: NA values in data.table 'y' end column: '
ru_ru: В data.table-таблице 'y' встречаются NA-значения в конце столбца:

source: in data.table 'y'.
ru_ru: в data.table-таблице `y`.

source: Some interval cols are of type POSIXct while others are not. Please ensure all interval cols are (or are not) of POSIXct type
ru_ru: Некоторые столбцы интервалов имеют тип POSIXct, в то время как прочие - другого типа. Пожалуйста, приведите все столбцы к какому-то одному типы (POSIXct или иному)

source: POSIXct interval cols have mixed timezones. Overlaps are performed on the internal numerical representation of POSIXct objects (always in UTC epoch time), therefore printed values may give the impression that values don't overlap but their internal representations do Please ensure that POSIXct type interval cols have identical 'tzone' attributes to avoid confusion.
ru_ru: Столбцы интервалов, заданные в POSIXct, имеют разные временные зоны. Пересечения вычисляются по внутренним численным представлениям POSIXct-объектов (unix timestamp), поэтому может получиться так, что выведенные на печать интервалы выглядят как непересекающиеся, при этом пересекаются их внутренние представления. Пожалуйста, приведите все столбцы с POSIXct-значениями к одной временной зоне 'tzone'.

source: Not yet implemented
ru_ru: Не реализовано

source: maxgap > minoverlap. maxgap will have no effect here.
ru_ru: maxgap > minoverlap, поэтому maxgap никак не влияет.

source: length(na.last) > 1, only the first element will be used
ru_ru: length(na.last) > 1, поэтому будет использован только первый элемент

source: x is a single vector, non-NULL 'cols' doesn't make sense
ru_ru: x - вектор, задавать значения аргумента 'cols' бессмысленно

source: Used more than one of the arguments input=, file=, text= and cmd=.
ru_ru: Должен использоваться только один из аргументов input=, file=, text= и cmd=.

source: Argument 'encoding' must be 'unknown', 'UTF-8' or 'Latin-1'.
ru_ru: Аргумент 'encoding' может принимать значения только 'unknown', 'UTF-8' или 'Latin-1'.

source: 'text=' is type
ru_ru: в аргумент 'text=' передано значение типа

source: but must be character.
ru_ru: вместо строкового (character).

source: input= must be a single character string containing a file name, a system command containing at least one space, a URL starting 'http[s]://', 'ftp[s]://' or 'file://', or, the input data itself containing at least one \n or \r
ru_ru: в input= необходимо передавать строку с названим файла, либо с системной командой, содержащей не менее одного пробела, либо URL, начинающийся с 'http[s]://', 'ftp[s]://' или 'file://'. Также можно передать строку с данными, но в строке должен быть хотя бы один знак новой строки (\n или \r)

source: input= contains no \n or \r, but starts with a space. Please remove the leading space, or use text=, file= or cmd=
ru_ru: значение, переданное в input=, не содержит \n или \r, при этом начинается с пробела. Пожалуйста, удалите пробел в начале либо используйте text=, file= или cmd=

source: Input URL requires https:// connection for which fread() requires 'curl' package which cannot be found. Please install 'curl' using 'install.packages('curl')'.
ru_ru: Указанный URL требует https:// соединение. Для импорта данных по такому соединению fread() использует пакет 'curl', который, видимо, не установлен. Пожалуйста, установите пакет 'curl' с помощью 'install.packages('curl')'.

source: Taking input= as a system command ('
ru_ru: input= проинтерпретировано как системная команда ('

source: ') and a variable has been used in the expression passed to `input=`. Please use fread(cmd=...). There is a security concern if you are creating an app, and the app could have a malicious user, and the app is not running in a secure environment; e.g. the app is running as root. Please read item 5 in the NEWS file for v1.11.6 for more information and for the option to suppress this message.
ru_ru: ') и переменная, использованная в выражении, была передана в `input=`. Пожалуйста, используйте fread(cmd=...). Использовать системные команды в input= вместо cmd= может быть небезопасно в тех случаях, когда вы создаете публичное приложение, с которым могут работать злонамеренные пользователи, и при этом приложение запускается в небезопасном окружении (с правами суперпользователя). Для более детальной информации и способе отключить это сообщение смотрите пункт 5 файла NEWS для версии 1.11.6.

source: File '
ru_ru: Файл '

source: ' does not exist or is non-readable. getwd()=='
ru_ru: ' не существует или его нельзя прочитать. getwd()=='

source: ' is a directory. Not yet implemented.
ru_ru: ' - директория. Не реализовано.

source: ' has size 0. Returning a NULL
ru_ru: ' имеет размер 0 (пустой). Возвращаем NULL

source: data.table
ru_ru: класса data.table

source: data.frame
ru_ru: , в противном случае возвращается data.frame

source: To read gz and bz2 files directly, fread() requires 'R.utils' package which cannot be found. Please install 'R.utils' using 'install.packages('R.utils')'.
ru_ru: Для чтения gz и bz2 требуется пакет 'R.utils' , который, видимо, не установлен. Пожалуйста, установите пакет 'R.utils' с помощью 'install.packages('R.utils' )'.

source: 'autostart' is now deprecated and ignored. Consider skip='string' or skip=n
ru_ru: аргумент 'autostart' в настоящий момент устарел и игнорируется. Попробуйте skip='string' или skip=n

source: colClasses is type 'logical' which is ok if all NA but it has some TRUE or FALSE values in it which is not allowed. Please consider the drop= or select= argument instead. See ?fread.
ru_ru: colClasses могут быть типа 'logical' толкьо если все значения NA, однако в переданном векторе есть TRUE или FALSE, что недопустимо. Пожалуйста, используйте аргументы drop= или select=. Детали смотрите в справке ?fread.

source: colClasses is not type list or character vector
ru_ru: в colClasses можно использовать только список или строковый вектор (character)

source: colClasses="NULL" (quoted) is interpreted as colClasses=NULL (the default) as opposed to dropping every column.
ru_ru: colClasses="NULL" (в кавычках) интерпретируется как colClasses=NULL (значение по умолчанию), а не как удаление всех столбцов.

source: But strip.white=FALSE. Use strip.white=TRUE (default) together with na.strings="" to turn any number of spaces in string columns into <NA>
ru_ru: Указано, что strip.white=FALSE. Используйте strip.white=TRUE (значение по умолчанию) вместе с na.strings="" чтобы любое количество пробелов в строковом столбце читать как <NA>.

source: 'data.table' relies on the package 'yaml' to parse the file header; please add this to your library with install.packages('yaml') and try again.
ru_ru: 'data.table' использует пакет 'yaml' для парсинга заголовков файлов; пожалуйста, добавьте его в свою библиотеку пакетов с помощью install.packages('yaml') и попробуйте еще раз.

source: Combining a search string as 'skip' and reading a YAML header may not work as expected -- currently,
ru_ru: На данный момент сочетание поиска по тексту в 'skip' и чтения YAML-заголовков может работать непредсказуемым образом.

source: reading will proceed to search for 'skip' from the beginning of the file, NOT from the end of
ru_ru: чтение файла для поиска и пропуска указанной строки идет с начала файла, а не с конца

source: the metadata; please file an issue on GitHub if you'd like to see more intuitive behavior supported.
ru_ru: метаданных, пожалуйста, опубликуйте issue на Gitgub, если вы хотите,ч тобы была реализована поддержка более интуитивно понятного поведения.

source: Encountered <
ru_ru: Обнаруживается <

source: > at the first
ru_ru: > в первых

source: unskipped line (
ru_ru: непропущенных строках (

source: ), which does not constitute the start to a valid YAML header
ru_ru: ) что не похоже на корректный YAML-заголовок

source: (expecting something matching regex "
ru_ru: (ожидается что-то, соответствующее регулярному выражению

source: "); please check your input and try again.
ru_ru: ); пожалуйста, перепроверьте, что вы хотите импортировать, и попробуйте еще раз.

source: Reached the end of the file before finding a completion to the YAML header. A valid YAML header is bookended by lines matching
ru_ru: Файл прочтен полностью, однако не найдено никаких соответствий YAML-заголовку. Корректный YAML-заголовок содержит строки, соответствующие

source: the regex "
ru_ru: регулряному выражению "

source: ". Please double check the input file is a valid csvy.
ru_ru: ". Пожалуйста, перепроверьте, что csv-файл, который вы хотите импортировать, валиден.

source: User-supplied 'header' will override that found in metadata.
ru_ru: Заданный пользователем заголовок 'header' перезапишет тот, который был найден в метаданных.

source: User-supplied column names in 'col.names' will override those found in YAML metadata.
ru_ru: Заданные пользователем в 'col.names' названия столбцов перезапишут те, что были найдены в YAML-метаданных.

source: colClasses dictated by user input and those read from YAML header are in conflict (specifically, for column
ru_ru: colClasses, указанные пользователем конфликтуют с теми, что найдены в YAML-заголовке (в частности, для столбца

source: s
ru_ru: (ов)

source: ]); the proceeding assumes the user input was
ru_ru: ]); предполагается, что заданные пользователем значения

source: an intentional override and will ignore the types implied by the YAML header; please exclude
ru_ru: целенаправленно должны перезаписать значения из YAML-заголовка; пожалуйста, исключите

source: these columns
ru_ru: эти столбцы, если это произошло непреднамеренно.

source: this column from colClasses if this was unintentional.
ru_ru: этот столбец из colClasses, если это произошло непреднамеренно.

source: User-supplied 'sep' will override that found in metadata.
ru_ru: Заданный пользователем разделитель 'sep' перезапишет тот, который был найден в метаданных.

source: User-supplied 'quote' will override that found in metadata.
ru_ru: Заданное пользователем значение аргумента 'quote' перезапишет то, которое было найдено в метаданных.

source: User-supplied 'dec' will override that found in metadata.
ru_ru: Заданный пользователем десятичный разделитель 'sep' перезапишет тот, который был найден в метаданных.

source: User-supplied 'na.strings' will override that found in metadata.
ru_ru: Заданное пользователем значение аргумента 'na.strings' перезапишет то, которое было найдено в метаданных.

source: Column '
ru_ru: Столбец '

source: ' was requested to be '
ru_ru: ' должен быть класса

source: ' but fread encountered the following
ru_ru: , но fread обнаружила следующую

source: error
ru_ru: ошибку

source: warning
ru_ru: предупреждение

source: so the column has been left as type '
ru_ru: , соответственно, столбец должен быть типа

source: dateTimeAs must be a single string
ru_ru: dateTimeAs должен быть строкой, единичной длинны

source: dateTimeAs must be 'ISO','squash','epoch' or 'write.csv'
ru_ru: dateTimeAs должен быть 'ISO','squash','epoch' или 'write.csv'

source: logicalAsInt has been renamed logical01. Use logical01 only, not both.
ru_ru: logicalAsInt переименован в logical01. Используйте logical01.

source: x being coerced from class: matrix to data.table
ru_ru: x был приведён из класса matrix к data.table

source: Input has no columns; doing nothing.
ru_ru: Ввод не содержит столбцов; ничего не делаем.

source: If you intended to overwrite the file at
ru_ru: Если вы намеревались перезаписать файл

source: with an empty one, please use file.remove first.
ru_ru: пустым, пожалуйста, используйте сначала file.remove.

source: Input has no columns; creating an empty file at '
ru_ru: Ввод не содержит столбцов, создаём пустой файл '

source: ' and exiting.
ru_ru: ' и выходим.

source: 'data.table' relies on the package 'yaml' to write the file header; please add this to your library with install.packages('yaml') and try again.
ru_ru: 'data.table' зависит от пакета 'yaml', чтобы записать метаданные в файл; пожалуйста, установите этот пакет с помощью команды install.packages('yaml') и попробуйте снова.

source: Argument 'x' must be a data.table object
ru_ru: Аргумент x должен быть объектом data.table

source: Argument 'by' must be a character vector of column names used in grouping.
ru_ru: Аргумент 'by' должен быть строковым вектором, содержащим названия столбцов, используемых для группировки.

source: Argument 'id' must be a logical scalar.
ru_ru: Аргумента 'id' должен быть скалярным логическим значением.

source: Input data.table must not contain duplicate column names.
ru_ru: Входящий data.table не должен содержать дублирующихся значений в названии столбцов.

source: Argument 'by' must have unique column names for grouping.
ru_ru: Аргумент 'by' должен содержать уникальные названия столбцов для группировки.

source: Argument 'sets' must be a list of character vectors.
ru_ru: Аргумент 'sets' должен быть списком строковым векторов.

source: All columns used in 'sets' argument must be in 'by' too. Columns used in 'sets' but not present in 'by':
ru_ru: Все столбцы, используемые в аргументе 'sets' также должны содержать в 'by'. Столбцы, используемые в 'sets', но не представленные в 'by':

source: When using `id=TRUE` the 'x' data.table must not have a column named 'grouping'.
ru_ru: При использовании `id=TRUE`, 'x' не должен содержать столбца с названием 'grouping'.

source: Character vectors in 'sets' list must not have duplicated column names within a single grouping set.
ru_ru: Строковый вектор в списке 'sets' не должен содержать повторяющихся названий столбцов в одном наборе группировки (grouping set).

source: 'sets' contains a duplicate (i.e., equivalent up to sorting) element at index
ru_ru: 'sets' содержит повторяющийся (т. е. эквивалентный до сортировки) элемент по индексу

source: ; as such, there will be duplicate rows in the output -- note that grouping by A,B and B,A will produce the same aggregations. Use `sets=unique(lapply(sets, sort))` to eliminate duplicates.
ru_ru: ; это приведёт к тому, что на выходе будут повторяющиеся строки -- обратите внимание, что группировка по A,B и B,A приведёт к одинаковым агрегациям. Используйте `sets=unique(lapply(sets, sort))` для устранения дубликатов.

source: Expression passed to grouping sets function must not update by reference. Use ':=' on results of your grouping function.
ru_ru: Выражение, переданное в функцию набор группировки, не должна изменять объекты по ссылке. Используйте ':=' для присвоения результатов применения функции группировки.

source: When using `id=TRUE` the 'j' expression must not evaluate to a column named 'grouping'.
ru_ru: При использовании `id=TRUE` выражение в 'j' не должно вычисляться в столбец с названием 'grouping'.

source: There exists duplicated column names in the results, ensure the column passed/evaluated in `j` and those in `by` are not overlapping.
ru_ru: В результатах есть повторяющиеся имена столбцов, убедитесь, что столбцы, переданные/вычисляемые в `j`, и столбцы в` by` не пересекаются.

source: Using integer64 class columns require to have 'bit64' package installed.
ru_ru: Для использования integer64 столбцов, требуется установленный пакет 'bit64'.

source: Argument 'sort' should be logical TRUE/FALSE
ru_ru: Аргумент 'sort' должен быть логическим (TRUE/FALSE)

source: Argument 'no.dups' should be logical TRUE/FALSE
ru_ru: Аргумент 'no.dups' должен быть логическим (TRUE/FALSE)

source: You are trying to join data.tables where
ru_ru: Вы пытаетесь объединить data.table'ы, где

source: 'x' and 'y' arguments are
ru_ru: аргументы 'X' и 'y'

source: 'x' argument is
ru_ru: аргумент 'x' является

source: 'y' argument is
ru_ru: аргумент 'y' является

source: 0 columns data.table.
ru_ru: пустым data.table (содержащим 0 столбцом.

source: `by.x` and `by.y` must be of same length.
ru_ru: `by.x` и `by.y` должны быть одинаковой длинны.

source: Supplied both `by` and `by.x/by.y`. `by` argument will be ignored.
ru_ru: Указаны оба аргумента: 'by` и `by.x/by.y`. Аргумент 'by' будет проигнорирован.

source: A non-empty vector of column names is required for `by.x` and `by.y`.
ru_ru: Для `by.x` и `by.y` требуется непустой вектор имен столбцов.

source: Elements listed in `by.x` must be valid column names in x.
ru_ru: Элементы, перечисленные в `by.x`, должны присутствовать в именах столбцов в x.

source: Elements listed in `by.y` must be valid column names in y.
ru_ru: Элементы, перечисленные в `by.y`, должны присутствовать в именах столбцов в y.

source: A non-empty vector of column names for `by` is required.
ru_ru: Для `by` требуется непустой вектор имен колонок.

source: Elements listed in `by` must be valid column names in x and y
ru_ru: Элементы, перечисленные в `by`, должны присутствовать в именах столбцов в x и y.

source: column names
ru_ru: имена столбцов

source: are duplicated in the result
ru_ru: продублированы в результате

source: IN DEVELOPMENT built
ru_ru: В РАЗРАБОТКЕ built

source: using
ru_ru: использующий

source: threads (see ?getDTthreads). Latest news: r-datatable.com
ru_ru: потоков (смотри ?getDTthreads). Последние новости: r-datatable.com

source: TRANSLATION CHECK
ru_ru: ПРОВЕРКА ПЕРЕВОДА

source: ********** Running data.table in English; package support is available in English only. When searching for online help, be sure to also check for the English error message. This can be obtained by looking at the po/R-<locale>.po and po/<locale>.po files in the package source, where the native language and English error messages can be found side-by-side **********
ru_ru: ********** Запускаем data.table на английском; поддержка пакета доступна только на английском. Когда ищите помощь онлайн, так же проверьте английское сообщение об ошибке. Его можно получить в файлах po/R-<locale>.po и po/<locale>.po в исходниках пакета. Этих файлы содержат перевод сообщений с вашего языка на английский . **********

source: ********** This development version of data.table was built more than 4 weeks ago. Please update: data.table::update.dev.pkg() **********
ru_ru: ********** Эта разработческая версия data.table была собрана более 4 недель назад. Пожалуйста, обновитесь: data.table::update.dev.pkg() **********

source: This installation of data.table has not detected OpenMP support. It should still work but in single-threaded mode.
ru_ru: Эта установка data.table не обнаружила поддержку OpenMP. data.table по-прежнему работает, но в однопоточном режиме.

source: This is a Mac. Please read https://mac.r-project.org/openmp/. Please engage with Apple and ask them for support. Check r-datatable.com for updates, and our Mac instructions here: https://github.com/Rdatatable/data.table/wiki/Installation. After several years of many reports of installation problems on Mac, it's time to gingerly point out that there have been no similar problems on Windows or Linux.
ru_ru: Это Мак. Пожалуйста, прочтите https://mac.r-project.org/openmp/. Пожалуйста, свяжитесь с Apple и попросите у них поддержки. Проверьте r-datatable.com на наличие обновлений и почитайте наши инструкции для Мака: https://github.com/Rdatatable/data.table/wiki/Installation. После нескольких лет частых сообщений о проблемах установки на Маках, настал момент осторожно указать, что на Linux и Windows таких проблем нет.

source: This is
ru_ru: Это

source: . This warning should not normally occur on Windows or Linux where OpenMP is turned on by data.table's configure script by passing -fopenmp to the compiler. If you see this warning on Windows or Linux, please file a GitHub issue.
ru_ru: . Это сообщение не должно появляться под Windows или Linux, где OpenMP включается конфигурационным скриптом data.table, который передает -fopenmp компилятору. Если вы видите это сообщение под Windows или Linux, пожалуйста, создайте issue на GitHub.

source: The option 'datatable.nomatch' is being used and is not set to the default NA. This option is still honored for now but will be deprecated in future. Please see NEWS for 1.12.4 for detailed information and motivation. To specify inner join, please specify `nomatch=NULL` explicitly in your calls rather than changing the default using this option.
ru_ru: Используется опция 'datatable.nomatch' и она не установлена в значение по умолчанию (NA). Эта опция все еще принимается во внимание, но будет считаться устаревшей в будущем. Пожалуйста, посмотрите NEWS к 1.12.4 версии data.table для подробной информации и причинах. Для того, чтобы указать внутреннее объединение, пожалуйста, явно укажите `nomatch=NULL` в ваших вызовах, а не меняйте значение по умолчанию с помощью этой опции.

source: The datatable.
ru_ru: Datatable.

source: version (
ru_ru: версия (

source: ) does not match the package (
ru_ru: ) не соответствует пакету (

source: ). Please close all R sessions to release the old
ru_ru: ). Пожалуйста, закройте все сессии R, чтобы разблокировать старую версию

source: and reinstall data.table in a fresh R session. The root cause is that R's package installer can in some unconfirmed circumstances leave a package in a state that is apparently functional but where new R code is calling old C code silently: https://bugs.r-project.org/bugzilla/show_bug.cgi?id=17478. Once a package is in this mismatch state it may produce wrong results silently until you next upgrade the package. Please help by adding precise circumstances to 17478 to move the status to confirmed. This mismatch between R and C code can happen with any package not just data.table. It is just that data.table has added this check.
ru_ru: и переустановите data.table в новой сессии R. Причина этой ошибки в том, что установщик пакетов R может при некоторых неподтвержденных обстоятельствах оставить пакет в состоянии, которое функционально, но где новый R-код безмолвно вызывает старый C-код: https://bugs.r-project.org/bugzilla/show_bug.cgi?id=17478. Пока пакет находится в этом состоянии несоответствия, он может тихо выдавть неправильные результаты до следующего обновления пакета. Пожалуйста, помогите, добавив точное описание ситуации к issue 17478, чтобы изменить статус issue в пдтвержденный. Это несоответствие между R и C кодом может случится с любым пакетом, а не только с data.table. Но только data.table выполняет эту проверку.

source: This is R
ru_ru: Это R

source: but data.table has been installed using R
ru_ru: но data.table был установлен с использованием R

source: . The major version must match. Please reinstall data.table.
ru_ru: . Мажорная версия должна совпадать. Пожалуйста, переустановите data.table.

source: Option 'datatable.old.bywithoutby' has been removed as warned for 2 years. It is now ignored. Please use by=.EACHI instead and stop using this option.
ru_ru: Опция 'datatable.old.bywithoutby' была удалена. Об этом предупреждалось на протяжении 2 лет. Сейчас она игнорируется - не используйте ее. Вместо нее используйте by=.EACHI.

source: Option 'datatable.old.unique.by.key' has been removed as warned for 4 years. It is now ignored. Please use by=key(DT) instead and stop using this option.
ru_ru: Опция 'datatable.old.unique.by.key' была удалена. Об этом предупреждалось на протяжении 4 лет. Сейчас она игнорируется - не используйте ее. Вместо нее используйте by=key(DT).

source: Unexpected base R behaviour: list(x) has copied x
ru_ru: Неожиданное поведение base R: list(x) скопировал x

source: Unexpected base R behaviour: names<- has copied column contents
ru_ru: Неожиданное поведение base R: names<- скопировал содержимое столбцов
