Repository: Leer/data.table
Catalog: po/R-*.po
Languages: ru_ru

source: Unexpected base R behaviour: DF[2,2]<- did not copy column 2 which was assigned to
ru_ru: Неожиданное поведение base R: DF[2,2]<- не скопировал столбец 2, к которому было присвоение

source: Unexpected base R behaviour: DF[2,2]<- copied the first column which was not assigned to, too
ru_ru: Неожиданное поведение base R: DF[2,2]<- также скопировал первый столбец, к которому не было присвоения

source: Unexpected base R behaviour: DF[2,2]<- has not copied address(DF)
ru_ru: Неожиданное поведение base R: DF[2,2]<- не скопировал address(DF)

source: Reminder to data.table developers: don't use getRversion() internally. Add a behaviour test to .onLoad instead.
ru_ru: Напоминание разработчикам data.table: не используйте внутри getRversion(). Вместо этого добавьте тест поведения в .onLoad.

source: Provide either threads= or percent= but not both
ru_ru: Установите либо threads=, либо percent=, но не оба аргумента

source: percent= is provided but is length
ru_ru: percent= передан, но он длины

source: but should be a number between 2 and 100
ru_ru: , а должен быть числом между 2 и 100

source: Valid options for col.names are 'auto', 'top', and 'none'
ru_ru: Допустимые варианты для col.names: 'auto', 'top' и 'none'

source: Column classes will be suppressed when col.names is 'none'
ru_ru: Классы столбцов будут подавлены, когда col.names == 'none'

source: Internal structure doesn't seem to be a list. Possibly corrupt data.table.
ru_ru: Не похоже, что внутренняя структура - список. Возможно, поврежденный data.table.

source: x may no longer be the character name of the data.table. The possibility was undocumented and has been removed.
ru_ru: x больше не может быть строковым именем data.table. Эта недокументированная возможность была удалена.

source: key(x)<-value is deprecated and not supported. Please change to use setkey() with perhaps copy(). Has been warning since 2012 and will be an error in future.
ru_ru: key(x)<-value устарела и не поддерживается. Пожалуйста, используйте setkey() и, может быть, copy(). Об этом предупреждается с 2012 года и это станет ошибкой в будущем.

source: x is not a data.table
ru_ru: x не является таблицей data.table

source: cols is not a character vector. Please see further information in ?setkey.
ru_ru: cols не является вектором типа character. Дополнительную информацию можно найти в справке ?setkey.

source: Setting a physical key on .SD is reserved for possible future use; to modify the original data's order by group. Try setindex() instead. Or, set*(copy(.SD)) as a (slow) last resort.
ru_ru: Установка физического ключа в .SD зарезервирована для использования в будущем; для изменения порядка в исходных данных по группам. Попробуйте вместо этого использовать setindex() или set*(copy(.SD)) в качестве последнего (медленного) варианта

source: cols is a character vector of zero length. Removed the key, but use NULL instead, or wrap with suppressWarnings() to avoid this warning.
ru_ru: cols является вектором типа character нулевой длины. Удалите ключ, используя вместо него NULL, или оберните вызов в suppressWarnings() для предотвращения вывода предупреждения.

source: cols is the empty string. Use NULL to remove the key.
ru_ru: cols является пустой строкой. Используйте NULL для удаления ключа.

source: cols contains some blanks.
ru_ru: cols содержит пустые значения.

source: some columns are not in the data.table:
ru_ru: некоторые столбцы отсутствуют в таблице data.table:

source: x contains a column called '.xi'. Conflicts with internal use by data.table.
ru_ru: x содержит столбец с именем '.xi'. Конфликт с внутренними именами переменных data.table.

source: ' is type '
ru_ru: ' имеет тип '

source: ' which is not supported as a key column type, currently.
ru_ru: ', который в данный момент не поддерживается в качестве ключа.

source: Internal error. 'cols' should be character at this point in setkey; please report.
ru_ru: Внутренняя ошибка. 'cols' в setkey должен быть вектором типа character; пожалуйста, сообщите об этой ошибке.

source: Internal error: index '
ru_ru: Внутренняя ошибка: индекс '

source: ' exists but is invalid
ru_ru: ' существует, но является недопустимым

source: x is vector but 'by' is supplied
ru_ru: x является вектором, но в 'by' поддерживается

source: x is a single vector, non-NULL 'by' doesn't make sense
ru_ru: x является отдельным вектором, значения 'by', не равные NULL, не имеют смысла

source: Attempting to order a 0-column data.table or data.frame.
ru_ru: Попытка сортировки таблицы data.table или data.frame с 0 столбцов

source: The first item passed to [f]order is a plain list but there are more items. It should be a data.table or data.frame.
ru_ru: Первый элемент, переданный в [f]order, является простым списком, но также присутствуют другие элементы. Он должен быть таблицей data.table или data.frame.

source: Internal code should not be being called on type double
ru_ru: Внутренний код не должен вызываться для типа double

source: Input is not a vector of type double. New parallel sort has only been done for double vectors so far. Using one thread.
ru_ru: Входной вектор не является вектором типа double. Новая параллельная сортировка выполняется только для векторов типа double. Используется один поток.

source: New parallel sort has not been implemented for decreasing=TRUE so far. Using one thread.
ru_ru: Новая параллельная сортировка пока не реализована для decreasing=TRUE. Используется один поток.

source: New parallel sort has not been implemented for vectors containing NA values so far. Using one thread.
ru_ru: Новая параллельная сортировка пока не реализована для векторов, содержащих NA. Используется один поток.

source: x must be a data.frame or data.table
ru_ru: x должен быть таблицей data.frame или data.table

source: na.last must be logical TRUE/FALSE
ru_ru: na.last должен иметь тип logical (TRUE/FALSE)

source: cols is not a character vector. Please see further information in ?setorder.
ru_ru: cols не является вектором типа character. Дополнительную информацию можно найти в справке ?setorder.

source: cols is a character vector of zero length. Use NULL instead, or wrap with suppressWarnings() to avoid this warning.
ru_ru: cols является вектором типа character нулевой длины. Используйте вместо него NULL, или оберните вызов в suppressWarnings() для предотвращения вывода предупреждения.

source: ' which is not supported for ordering currently.
ru_ru: ', который в настоящий момент не поддерживается для сортировки.

source: 'sorted' is TRUE but element
ru_ru: 'sorted' равен TRUE, но элемент

source: is non-atomic, which can't be sorted; try setting sorted = FALSE
ru_ru: не является атомарным и не может быть отсортирован; попробуйте задать sorted = FALSE

source: Cross product of elements provided to CJ() would result in %.0f rows which exceeds .Machine$integer.max == %d
ru_ru: Произведение элементов, заданных в CJ(), создаст результат с %.0f строками, что превышает значение .Machine$integer.max == %d

source: x and y must both be data.tables
ru_ru: x и y должны быть таблицами data.table

source: When x's column ('
ru_ru: Когда столбец x ('

source: ') is character, the corresponding column in y ('
ru_ru: ') имеет тип character, соответствующий столбец в y ('

source: ') should be factor or character, but found incompatible type '
ru_ru: ') должен иметь тип factor или character, но обнаружен несовместимый тип '

source: ') is factor, the corresponding column in y ('
ru_ru: ') является фактором, соответствующий столбец в y ('

source: ') should be character or factor, but found incompatible type '
ru_ru: ') должен иметь тип character или factor, но обнаружен несовместимый тип '

source: ') is integer or numeric, the corresponding column in y ('
ru_ru: ') имеет тип integer или numeric, соответствующий столбец в y ('

source: ') can not be character or logical types, but found incompatible type '
ru_ru: ') не может иметь тип character или logical, но обнаружен несовместимый тип '

source: argument 'all' should be logical of length one
ru_ru: аргумент 'all' должен иметь тип logical и длину, равную 1

source: x and y must have the same column names
ru_ru: x и y должны иметь одни и те же имена столбцов

source: x and y must have the same column order
ru_ru: x и y должны иметь один и тот же порядок столбцов

source: unsupported column type
ru_ru: неподдерживаемый тип столбца

source: found in x or y:
ru_ru: обнаружено в x или y:

source: of x is '
ru_ru: в x является '

source: ' but the corresponding item of y is '
ru_ru: ', но соответствующим элементом в y является '

source: None of the datasets should contain a column named '.seqn'
ru_ru: Ни один из наборов данных не должен содержать столбцов с именем '.seqn'

source: Internal error: ncol(current)==ncol(target) was checked above
ru_ru: Количество столбцов в сравниваемых датасетах не совпадает

source: None of the datasets to compare should contain a column named '.seqn'
ru_ru: Датасеты не должны иметь столбцы с '.seqn' в названии

source: Datasets to compare with 'ignore.row.order' must not have unsupported column types:
ru_ru: При использовании 'ignore.row.order' в датасетах не должно быть неподдерживаемых типов столбцов:

source: Argument 'tolerance' was forced to lowest accepted value `sqrt(.Machine$double.eps)` from provided
ru_ru: Значение аргумента 'tolerance' было изменено на минимальное допустимое значение `sqrt(.Machine$double.eps)`

source: Duplicate rows in datasets, numeric columns and ignore.row.order cannot be used with non 0 tolerance argument
ru_ru: В датасетах встречаются дубликаты строк, численные столбцы и ignore.row.order не могут быть использованы при ненулевом значении аргумента 'tolerance'

source: Factor columns and ignore.row.order cannot be used with non 0 tolerance argument
ru_ru: Столбцы-факторы (factor) и ignore.row.order не могут быть использованы при ненулевом значении аргумента 'tolerance'

source: argument 'fill' ignored, only make sense for type='const'
ru_ru: аргумент 'fill' проигнорирован, так как он имеет смысл только при type='const'

source: order.col='
ru_ru: Значение в order.col='

source: ' not a column name of info
ru_ru: ' должно быть названием одного из информационных столбцов (MB, NAME, NROW, NCOL, COLS, KEY, INDICES)

source: data.table package is loaded. Unload or start a fresh R session.
ru_ru: пакет data.table уже загружен. Выгрузите пакет или начните новую R-сессию.

source: script must end with '.Rraw'. If a file ending '.Rraw.bz2' exists, that will be found and used.
ru_ru: скрипт должен иметь расширение '.Rraw' или '.Rraw.bz2'.

source: Neither %s nor %s exist in %s
ru_ru: Ни скрипта %s, ни скрипта %s нет в директории %s

source: Failed after test
ru_ru: Завершился ошибкой тест

source: before the next test() call in
ru_ru: , перед следующим вызовом test() в

source: . Search
ru_ru: тестов. Смотрите в

source: for test number
ru_ru: следующие номера тестов:

source: vs
ru_ru: вместо

source: Test
ru_ru: Тест

source: is invalid: when error= is provided it does not make sense to pass y as well
ru_ru: некорректен: если задан аргумент error=, нет необходимости задавать значение аргумента y

source: Use started.at=proc.time() not Sys.time() (POSIXt and slow)
ru_ru: Используйте started.at=proc.time(), а не Sys.time(), которая медленная и использует POSIXt

source: make.names='
ru_ru: Столбцы, названия или номера которых заданы в make.names='

source: ' not found in names of input
ru_ru: ' не найдены в входящем датасете

source: make.names=
ru_ru: Количество столбцов, перечисленных в make.names=

source: is out of range [1,ncol=
ru_ru: должно быть меньше или равно количеству столбцов в датасете [1, ncol=

source: 'names' must be TRUE/FALSE or a character vector.
ru_ru: Значения в 'names' должны быть TRUE/FALSE или вектором строковых значений (character).

source: 'keep' should contain integer values between
ru_ru: Аргумент 'keep' должен содержать целые значения из интервала

source: ) is not equal to length(
ru_ru: ) не равно количеству колонок в результате

source: l not type list
ru_ru: в l можно использовать только список

source: Argument 'nan' must be length 1
ru_ru: Передаваемый аргумент должен состоять из одного элемента

source: Argument 'nan' must be NA or NaN
ru_ru: Аргумент должен иметь значение NA или NaN

source: x not boolean
ru_ru: x не логического типа (boolean)

source: Some columns are type 'integer64' but package bit64 is not installed. Those columns will print as strange looking floating point data. There is no need to reload the data. Simply install.packages('bit64') to obtain the integer64 print method and print the data again.
ru_ru: Некоторые столбцы типа 'integer64' , однако пакет bit64 не установлен. Эти столбцы будут отображаться в виде чисел с плавающей точкой. Нет необходимости перезагружать данные. Достаточно будет установить пакет bit64 с помощью install.packages('bit64'), подключить его и и заново вывести на печать данные.

source: Pattern
ru_ru: Паттерн(ы)

source: not found: [
ru_ru: не найден(ы): [

source: keep.rownames must be length 1
ru_ru: в аргумент keep.rownames необходимо передавать только одно значение

source: keep.rownames must not be NA
ru_ru: в keep.rownames нельзя использовать NA

source: Input xts object should not have '%s' column because it would result in duplicate column names. Rename '%s' column in xts or use `keep.rownames` to change the index column name.
ru_ru: Во входящем xts-объекте не должно быть столбца '%s', потому что это вызовет дупликацию названий столбцов. Переименуйте столбец '%s' в xts или используйте аргумент `keep.rownames`, чтобы изменить название столбца индекса.

source: data.table must have a time based column in first position, use `setcolorder` function to change the order, or see ?timeBased for supported types
ru_ru: Первым столбцом в data.table-таблице должен быть столбец с временем, используйте `setcolorder` для изменения порядка столбцов, или смотрите справку ?timeBased по поддерживаемым типам.

source: Following columns are not numeric and will be omitted:
ru_ru: Следующие столбцы нечисленного типа и будут удалены:

source: %d variable not shown: %s
ru_ru: %d переменная не отображена: %s
