Repository: Leer/data.table
Catalog: po/R-*.po
Languages: ru_ru

source: data.table package loaded. When developing don't load package
ru_ru: пакет data.table загружен. Не загружайте пакет при разработке

source: binary + is not defined for "IDate" objects
ru_ru: бинарный + не определён для объектов "IDate"

source: can only subtract from "IDate" objects
ru_ru: можно вычитать только из объектов "IDate"

source: unary - is not defined for "IDate" objects
ru_ru: унарный - не определён для объектов IDate

source: Valid options for ms are 'truncate',
ru_ru: Допустимыми значениями для ms являются 'truncate',

source: 'nearest', and 'ceil'.
ru_ru: 'nearest' и 'ceil'.

source: as.data.table.array method should only be called for arrays with 3+ dimensions; use the matrix method for 2-dimensional arrays
ru_ru: as.data.table.array метод должен быть вызван только для массивов с 3+ измерениями; используйте matrix метод для 2-мерных массивов

source: Argument 'value.name' must be scalar character, non-NA and at least one character
ru_ru: Аргумент 'value.name' должен быть скалярным строковым значением, не NA и содержать более одного символа

source: Argument 'sorted' must be scalar logical and non-NA
ru_ru: Аргумент 'sorted' должен бать скалярным логическим значением и не NA

source: Argument 'na.rm' must be scalar logical and non-NA
ru_ru: Аргумент 'na.rm' должен быть скалярным логическим значением и не NA

source: Please provide either 'key' or 'sorted', but not both.
ru_ru: Пожалуйста, укажите 'key' или 'sorted', но не оба.

source: Argument 'value.name' should not overlap with column names in result:
ru_ru: Аргумент 'value.name' не должен совпадать с именами столбцов в результате:

source: POSIXlt column type detected and converted to POSIXct. We do not recommend use of POSIXlt at all because it uses 40 bytes to store one date.
ru_ru: Обнаружен тип столбца POSIXlt, который был преобразован в POSIXct. Мы не рекомендуем использовать POSIXlt вообще, потому что он использует 40 байт для хранения одной даты.

source: Item
ru_ru: Элемент

source: has
ru_ru: имеет

source: rows but longest item has
ru_ru: строк, но самый длинный элемент имеет

source: has 0 rows but longest item has
ru_ru: имеет 0 строк, но самый длинный элемент имеет

source: ; filled with NA
ru_ru: ; заполнено NA

source: A column may not be called .SD. That has special meaning.
ru_ru: Столбец не может быть назван .SD. Это имя зарезервировано.

source: class must be length 1
ru_ru: атрибут class должен иметь длину 1

source: between has been passed an argument x of type logical
ru_ru: в between был передан аргумент x логического типа

source: 'between' function the 'x' argument is a POSIX class while 'lower' was not, coercion to POSIX failed with:
ru_ru: Аргумент 'x' в функции 'between' POSIX, в том время как 'lower' нет, преобразование в POSIX не удалось по причине:

source: 'between' function the 'x' argument is a POSIX class while 'upper' was not, coercion to POSIX failed with:
ru_ru: Аргумент 'x' в функции 'between' POSIX, в том время как 'upper' нет, преобразование в POSIX не удалось по причине:

source: 'between' lower= and upper= are both POSIXct but have different tzone attributes:
ru_ru: Оба Аргумента lower= и upper= функции 'between' - POSIXct, но имеют различные атрибуты tzone:

source: . Please align their time zones.
ru_ru: . Пожалуйста, согласуйте их временные зоны.

source: 'between' arguments are all POSIXct but have mismatched tzone attributes:
ru_ru: Все аргументы 'between' POSIXct, но имеют различающиеся атрибуты tzone:

source: . The UTC times will be compared.
ru_ru: . Будет сопоставлено время в UTC.

source: trying to use integer64 class when 'bit64' package is not installed
ru_ru: попытка использовать класс integer64, в то время как пакет 'bit64' не установлен

source: Not yet implemented NAbounds=TRUE for this non-numeric and non-character type
ru_ru: NAbounds=TRUE ещё не реализован для этого не числового (non-numeric) и не строкового (non-character) типов

source: Some lower>upper for this non-numeric and non-character type
ru_ru: Некоторые lower>upper для этого не числового (non-numeric) и не строкового (non-character) типа

source: RHS has length()
ru_ru: RHS имеет длинну length()

source: ; expecting length 2.
ru_ru: ; ожидается длинна 2.

source: Perhaps you meant %s?
ru_ru: Возможно вы имели в виду %s?

source: The first element should be the lower bound(s);
ru_ru: Первый элемент должен быть нижней границей;

source: the second element should be the upper bound(s).
ru_ru: второй элемент должен быть верхней границей.

source: is type
ru_ru: имеет тип

source: which is not supported by data.table join
ru_ru: , который не поддерживается data.table объединением

source: Attempting roll join on factor column when joining x.
ru_ru: Попытка скользящего объединение (roll join) по факторному столбцу при объединении x.

source: to i.
ru_ru: с i.

source: Incompatible join types: x.
ru_ru: Не совместимые типы для объединения: x.

source: ) and i.
ru_ru: ) и i.

source: ). Factor columns must join to factor or character columns.
ru_ru: ). Факторные столбцы должны объединяться с факторными (factor) или строковыми (character) столбцами.

source: Incompatible join types:
ru_ru: Несовместимость объединяемых типов:

source: is type integer64 but
ru_ru: является типом integer64, а

source: is type double and contains fractions
ru_ru: является типом double и содержит дроби

source: roll is not implemented for non-equi joins yet.
ru_ru: скольжение (roll) ещё не реализовано для неэквивалентных объединений.

source: Column name '_nqgrp_' is reserved for non-equi joins.
ru_ru: Имя столбца '_nqgrp_' зарезервировано для неэквивалентных объединений.

source: key argument of data.table() must be character
ru_ru: data.table аргумент key должен быть строковым вектором

source: Object '
ru_ru: Объект '

source: ' not found. Perhaps you intended
ru_ru: ' не найден. Возможно вы имели в виду

source: or
ru_ru: или

source: more
ru_ru: более

source: ' not found amongst
ru_ru: ' не найден среди

source: and
ru_ru: и

source: Provide either by= or keyby= but not both
ru_ru: Укажите или by= или keyby=, но не оба

source: Ignoring keyby= because j= is not supplied
ru_ru: keyby= игнорируется, так как j= не указан

source: Ignoring by= because j= is not supplied
ru_ru: by= игнорируется, так как j= не указан

source: When on= is provided but not i=, on= must be a named list or data.table|frame, and a natural join (i.e. join on common names) is invoked. Ignoring on= which is '
ru_ru: Когда указан on= и не указан i=, on= должен быть именованным списком или data.table|frame. Будет выполнено естественное объединение (то есть объединение по общим столбцам) и on= ('

source: i and j are both missing so ignoring the other arguments. This warning will be upgraded to error in future.
ru_ru: i и j не указаны, так что остальные аргументы проигнорированы. Данное предупреждение будет преобразовано в ошибку в будущем.

source: mult argument can only be 'first', 'last' or 'all'
ru_ru: Аргумент mult может принимать только следующие значения: 'first', 'last' или 'all'.

source: roll must be a single TRUE, FALSE, positive/negative integer/double including +Inf and -Inf or 'nearest'
ru_ru: roll должен быть скалярным TRUE, FALSE, положительным/отрицательным целым/дробным числом, включая +Inf и -Inf, или 'nearest'

source: roll is '
ru_ru: roll является '

source: ' (type character). Only valid character value is 'nearest'.
ru_ru: ' (строковый тип). Валидным строковым значением может быть только 'nearest'.

source: rollends must be a logical vector
ru_ru: rollends должен быть логическим вектором

source: rollends must be length 1 or 2
ru_ru: длинна rollends должна быть 1 или 2

source: nomatch= must be either NA or NULL (or 0 for backwards compatibility which is the same as NULL)
ru_ru: nomatch= должен быть NA или NULL (или 0 для обратной совместимости, что означает тоже, что и NULL)

source: which= must be a logical vector length 1. Either FALSE, TRUE or NA.
ru_ru: which= должен быть логическим вектором длинной 1. TRUE, FALSE или NA.

source: (meaning return row numbers) but j is also supplied. Either you need row numbers or the result of j, but only one type of result can be returned.
ru_ru: (означает вернуть номера строк), но вы также указали j. Вы можете получить номера строк или результат выполнения j (только один тип результата может быть получен).

source: which=NA with nomatch=0 would always return an empty vector. Please change or remove either which or nomatch.
ru_ru: указание which=NA вместе с nomatch=0 всегда возвращают пустой вектор. Измените или удалите which или nomatch.

source: j must be provided when with=FALSE
ru_ru: j должен быть указан, когда with=FALSE

source: The symbol .. is invalid. The .. prefix must be followed by at least one character.
ru_ru: Символ .. не корректный. Префикс .. должен предшествовать строковому значению, содержащему не менее одного символа.

source: Variable '
ru_ru: Переменная '

source: is not found in calling scope
ru_ru: не найден в области видимости вызова

source: When the first argument inside DT[...] is a single symbol (e.g. DT[var]), data.table looks for var in calling scope.
ru_ru: Когда первый аргумент в DT[...] - единственный символ (например, DT[var]), data.table ищет этот символ в области видимости вызова.

source: i is invalid type (matrix). Perhaps in future a 2 column matrix could return a list of elements of DT (in the spirit of A[B] in FAQ 2.14). Please report to data.table issue tracker if you'd like this, or add your comments to FR #657.
ru_ru: неправильный тип i - матрица. Возможно, в будущем матрица с двумя столбцами вернет список элементов DT (в духе матричного A[B], см. FAQ 2.14). Пожалуйста, напишите в трекер data.table, если вам нравится эта идея или прокомментируйте её в FR #657.

source: When i is a data.table (or character vector), the columns to join by must be specified using 'on=' argument (see ?data.table), by keying x (i.e. sorted, and, marked as sorted, see ?setkey), or by sharing column names between x and i (i.e., a natural join). Keyed joins might have further speed benefits on very large data due to x being sorted in RAM.
ru_ru: Когда i -- data.table (или символьный вектор), столбцы для объединения должны быть указаны с помощью аргумента 'on=' (см ?data.table), с помощью индексирования x (т. е. отсортированы и помечены как сортированные, см ?setkey), или с помощью общих имен между x и i (т. е. естественное объединение). Индексированные объединения могут иметь дополнительный выигрыш в скорости на очень больших данных, благодаря тому, что x отсортировано в RAM.

source: Attempting to do natural join but no common columns in provided tables
ru_ru: Попытались сделать естественное объединение, но в таблицах нет общих столбцов

source: Internal error. Cannot by=.EACHI when joining to a secondary key, yet
ru_ru: Внутренняя ошибка. Пока что нельзя объединять таблицы по вторичному ключу с by=.EACHI

source: Internal error. irows has length in by=.EACHI
ru_ru: Внутренняя ошибка. irows имеет длину в by=.EACHI

source: logical error. i is not a data.table, but 'on' argument is provided.
ru_ru: логическая ошибка. i не data.table, но присутствует аргумент 'on'.

source: i has evaluated to type
ru_ru: i имеет тип

source: . Expecting logical, integer or double.
ru_ru: . Ожидается logical, integer или double.

source: i evaluates to a logical vector length
ru_ru: i - логический вектор длины

source: but there are
ru_ru: но у нас

source: rows. Recycling of logical i is no longer allowed as it hides more bugs than is worth the rare convenience. Explicitly use rep(...,length=.N) if you really need to recycle.
ru_ru: строк. Повторение логического i больше не разрешается, так как оно приносит больше ошибок, чем пользы. Явно используйте rep(...,length=.N) если вам действительно надо повторение.

source: Internal error: notjoin but byjoin or !integer or nomatch==NA
ru_ru: Внутренняя ошибка: notjoin, но byjoin или !integer или nomatch==NA

source: with=FALSE together with := was deprecated in v1.9.4 released Oct 2014. Please wrap the LHS of := with parentheses; e.g., DT[,(myVar):=sum(b),by=a] to assign to column name(s) held in variable myVar. See ?':=' for other examples. As warned in 2014, this is now a warning.
ru_ru: with=FALSE вместе с := было признано устаревшим в версии 1.9.4 от октября 2014. Пожалуйста, заключите левую часть := в скобочки. Например, DT[,(myVar):=sum(b),by=a] присваивает значение столбцу, чье имя содержится в переменной myVar.Еще больше примеров можно увидеть, набрав ?':=' в консоли.

source: with=FALSE ignored, it isn't needed when using :=. See ?':=' for examples.
ru_ru: with=FALSE проигнорировано, оно не нужно, когда используется :=. Смотри ?':=' для примеров.

source: column(s) not removed because not found:
ru_ru: столбец(-ы) не удалены, потому что не найдены:

source: column(s) not found:
ru_ru: столбец(-ы) не найдены:

source: of j is
ru_ru: из j равны

source: which is outside the column number range [1,ncol=
ru_ru: что за пределами диапазона номеров колонок [1,ncol=

source: j mixes positives and negatives
ru_ru: в j перемешаны положительные и отрицательные значения

source: When with=FALSE, j-argument should be of type logical/character/integer indicating the columns to select.
ru_ru: Когда with=FALSE, аргумент j должен быть типа logical/character/integer, указывающим на колонки, которые надо выбрать.

source: by=c(...), key(...) or names(...) must evaluate to 'character'
ru_ru: by=c(...), key(...) или names(...) должны давать строковое значение

source: 'by' is a character vector length
ru_ru: 'by' - строковый вектор длины

source: but one or more items include a comma. Either pass a vector of column names (which can contain spaces, but no commas), or pass a vector length 1 containing comma separated column names. See ?data.table for other possibilities.
ru_ru: , но один или несколько его элементов содержат запятую. Используйте вектор с именами столбцов (который может содержать пробелы, но не запятые), или используйте вектор единичной длины, содержащий имена столбцов, разделенные запятыми. Смотри ?data.table для других вариантов.

source: Internal error: irows isn't integer
ru_ru: Внутренняя ошибка: irows не является целым значением

source: 'by' appears to evaluate to column names but isn't c() or key(). Use by=list(...) if you can. Otherwise, by=eval
ru_ru: результат 'by' является именами колонок, но это не c() и не key(). Если можете, используйте by=list(...). Иначе, by=eval

source: should work. This is for efficiency so data.table can detect which columns are needed.
ru_ru: должен сработать. Это сделано для эффективности, чтобы data.table мог понять, какие колонки нужны.

source: 'by' or 'keyby' must evaluate to a vector or a list of vectors (where 'list' includes data.table and data.frame which are lists, too)
ru_ru: 'by' или 'keyby' должны давать в результате вектор или список векторов (списками также считаются data.table и data.frame)

source: column or expression
ru_ru: столбец или выражение

source: of 'by' or 'keyby' is type
ru_ru: 'by' или 'keyby' являются типом

source: . Do not quote column names. Usage: DT[,sum(colC),by=list(colA,month(colB))]
ru_ru: . Не заключайте в кавычки имена столбцов. Использование: DT[,sum(colC),by=list(colA,month(colB))]

source: The items in the 'by' or 'keyby' list are length(s) (%s). Each must be length %d; the same length as there are rows in x (after subsetting if i is provided).
ru_ru: Длина элементов списка 'by' или 'keyby' равняется (%s). Каждый элемент должен быть длинной %d - это количество строк в x (после сабсета, если есть аргумент i).

source: Internal error: drop_dot passed
ru_ru: Внутренняя ошибка: передан drop_dot

source: items
ru_ru: элементы

source: Item %d of the .() or list() passed to j is missing
ru_ru: Элемент %d в .() или list(), переданный в j, пропущен

source: Different branches of j expression produced different auto-named columns:
ru_ru: Разные ветки j-выражения дают разные автоназвания столбцам:

source: ; using the most "last" names
ru_ru: ; используем самые "последние" имена

source: When .SDcols is a function, it is applied to each column; the output of this function must be a non-missing boolean scalar signalling inclusion/exclusion of the column. However, these conditions were not met for:
ru_ru: Когда .SDcols -- функция, она применяется к каждому столбцу; результат функции должен быть TRUE или FALSE, указывающими на включение/исключение столбца. Однако, эти условия не удовлетворены для:

source: .SDcols missing at the following indices:
ru_ru: .SDcols пропущены для следующих индексов:

source: .SDcols is numeric but has both +ve and -ve indices
ru_ru: .SDcols числовой, но в нем встречаются и положительные, и отрицательные индексы

source: .SDcols is numeric but out of bounds [1,
ru_ru: .SDcols числовой, но выходит за границы [1,

source: ] at:
ru_ru: ] в:

source: .SDcols should be column numbers or names
ru_ru: .SDcols должен быть именами или номерами столбцов

source: Some items of .SDcols are not column names:
ru_ru: Некоторые элементы .SDcols не являются именами столбцов:

source: '(m)get' found in j. ansvars being set to all columns. Use .SDcols or a single j=eval(macro) instead. Both will detect the columns used which is important for efficiency. Old ansvars: %s
ru_ru: в j найден '(m)get'. ansvars установлен как все колонки. Используйте вместо этого .SDcols или j=eval(macro). Оба варианта определят используемые колонки, что важно для эффективности. Старый ansvars: %s

source: New ansvars: %s
ru_ru: Новый ansvars: %s

source: This j doesn't use .SD but .SDcols has been supplied. Ignoring .SDcols. See ?data.table.
ru_ru: Этот j не использует .SD, но задан .SDcols. Игнорируем .SDcols. См. ?data.table.

source: .SD is locked. Using := in .SD's j is reserved for possible future use; a tortuously flexible way to modify by group. Use := in j directly to modify by group by reference.
ru_ru: .SD заблокирован. Использование := в .SD в j зарезервировано для возможного будущего использования - гибкого способа модифицировать по группам. Используйте := непосредственно в j для изменения по группам по ссылке.

source: In `:=`(col1=val1, col2=val2, ...) form, all arguments must be named.
ru_ru: В форме `:=`(col1=val1, col2=val2, ...) все аргументы должны быть с именами.

source: LHS of := must be a symbol, or an atomic vector (column names or positions).
ru_ru: Левая часть := должна быть символом или простым вектором с именами или позициями столбцов.

source: LHS of := appears to be column positions but are outside [1,ncol] range. New columns can only be added by name.
ru_ru: Левая часть := по-видимому, является позициями столбцов, но они не попадают в диапазон [1,ncol]. Новые столбцы могут добавляться только по имени.

source: LHS of := isn't column names ('character') or positions ('integer' or 'numeric')
ru_ru: Левая часть := не является именами столбцов ('character') или позициями ('integer' или 'numeric')

source: Invalid .internal.selfref detected and fixed by taking a (shallow) copy of the data.table so that := can add this new column by reference. At an earlier point, this data.table has been copied by R (or was created manually using structure() or similar). Avoid names<- and attr<- which in R currently (and oddly) may copy the whole data.table. Use set* syntax instead to avoid copying: ?set, ?setnames and ?setattr. If this message doesn't help, please report your use case to the data.table issue tracker so the root cause can be fixed or this message improved.
ru_ru: Обнаружен и исправлен (поверхностным) копированием неверный .internal.selfref, чтобы можно было добавить новый столбец по ссылке с помощью :=. Ранее этот data.table был скопирован самим R или был создан вручную с использованием structure() или подобного. Избегайте names<- и attr<-, при которых R может скопировать data.table целиком. Чтобы избежать копирования, используйте вместо них set* синтакс: ?set, ?setnames and ?setattr. Если это сообщение не помогло, сообщите, пожалуйста, ваш случай в data.table issue трекер, чтобы первопричина была исправлена или было улучшено это сообщение.

source: Cannot assign to an under-allocated recursively indexed list -- L[[i]][,:=] syntax is only valid when i is length 1, but it's length
ru_ru: Не можем присвоить недоразмещенной рекурсивно индексируемый список-- L[[i]][,:=]. Этот синтаксис работает, только когда длина i равна 1, но его длина

source: Internal error -- item '
ru_ru: Внутренняя ошибка -- элемент '

source: ' not found in names of list
ru_ru: ' не найден среди имен списка

source: Internal error -- column(s) not found:
ru_ru: Внутренняя ошибка -- столбец(ы) не найдены:

source: strptime() usage detected and wrapped with as.POSIXct(). This is to minimize the chance of assigning POSIXlt columns, which use 40+ bytes to store one date (versus 8 for POSIXct). Use as.POSIXct() (which will call strptime() as needed internally) to avoid this warning.
ru_ru: обнаружено использование strptime() и обернуто в as.POSIXct(). Это сделано, чтобы минимизировать шанс присваивания POSIXlt столбцов, которые используют 40+ байт чтобы хранить одну дату (POSIXct использует 8 байт). Чтобы избежать этого предупреждения, используйте as.POSIXct(), который вызовет strptime() при необходимости.

source: ' is not found in calling scope. Looking in calling scope because this symbol was prefixed with .. in the j= parameter.
ru_ru: ' не найден в области видимости вызова. Ищем в области видимости вызова, потому что символ начинается с .. в параметре j= .

source: Internal error: xcolAns does not pass checks:
ru_ru: Внутренняя ошибка: xcolAns не проходит проверки:

source: Internal error: irows is NULL when making join result at R level. Should no longer happen now we use CsubsetDT earlier.
ru_ru: Внутренняя ошибка: irows равен NULL, когда мы создаем результат объединения уровне R. Больше такого не должно быть, ранее мы использовали CsubsetDT.

source: j (the 2nd argument inside [...]) is a single symbol but column name '
ru_ru: j (второй аргумент внутри [...]) - единичный символ, но имя столбца '

source: ' is not found. Perhaps you intended DT[, ..
ru_ru: ' не найдена. Возможно, вы имели ввиду DT[, ..

source: ]. This difference to data.frame is deliberate and explained in FAQ 1.1.
ru_ru: ]. Эта разница с классическим data.frame намеренная и объясняется в FAQ 1.1.

source: Internal error: j has created a data.table result containing a NULL column
ru_ru: Внутренняя ошибка: j создает data.table, содержащий NULL-столбец

source: The column '.N' can't be grouped because it conflicts with the special .N variable. Try setnames(DT,'.N','N') first.
ru_ru: Столбец '.N' не может быть сгруппирован, потому что он конфликтует со специальной переменной .N. Попробуйте сначала сделать setnames(DT,'.N','N').

source: The column '.I' can't be grouped because it conflicts with the special .I variable. Try setnames(DT,'.I','I') first.
ru_ru: Столбец '.I' не может быть сгруппирован, потому что он конфликтует со специальной переменной .I. Попробуйте сначала сделать setnames(DT,'.I','I').

source: logical error. i is not data.table, but mult='all' and 'by'=.EACHI
ru_ru: логическая ошибка. i не data.table, но mult='all' и 'by'=.EACHI

source: Internal error: by= is missing
ru_ru: Внутренняя ошибка: by= пропущен

source: Internal error: byindex not the index name
ru_ru: Внутренняя ошибка: byindex не является именем индекса

source: Internal error: byindex not found
ru_ru: Внутренняя ошибка: byindex не найден
