Repository: Leer/data.table
Catalog: po/R-*.po
Languages: ru_ru

source: Unable to optimize call to mean() and could be very slow. You must name 'na.rm' like that otherwise if you do mean(x,TRUE) the TRUE is taken to mean 'trim' which is the 2nd argument of mean. 'trim' is not yet optimized.
ru_ru: Не могу оптимизировать вызов mean() и он может быть очень медленным. Вы должны дать аргументу имя 'na.rm', иначе, если вы вызываете mean(x,TRUE), TRUE берется, как 'trim' - второй аргумент функции mean. 'trim' пока еще не оптимизирован.

source: Internal error: length(irows)!=length(o__)
ru_ru: Внутренняя ошибка: length(irows)!=length(o__)

source: The setkey() normally performed by keyby= has been skipped (as if by= was used) because := is being used together with keyby= but the keyby= contains some expressions. To avoid this warning, use by= instead, or provide existing column names to keyby=.
ru_ru: Не выполнен setkey(), обычно выполняемый keyby= (результат, как будто вы использовали by= ). Это произошло потому что := использован вместе с keyby=, но keyby= содержит выражения. Чтобы избежать этого предупреждения, используйте by= , или используйте существующие имена столбцов в keyby=.

source: Internal error: jvnames is length
ru_ru: Внутренняя ошибка: jvnames - длина

source: but ans is
ru_ru: , но ans

source: and bynames is
ru_ru: и bynames

source: rownames and rownames.value cannot both be used at the same time
ru_ru: rownames и rownames.value не могут использоваться одновременно

source: but nrow(DT)==
ru_ru: , но nrow(DT)==

source: . The rownames argument specifies a single column name or number. Consider rownames.value= instead.
ru_ru: . Аргумент rownames определяет единственное имя или номер столбца. Попробуйте вместо этого rownames.value= .

source: length(rownames)==0 but should be a single column name or number, or NULL
ru_ru: length(rownames)==0, но должно быть именем или номером одного столбца или NULL

source: rownames is TRUE but key has multiple columns
ru_ru: rownames равно TRUE, но ключ имеет много столбцов

source: ; taking first column x[,1] as rownames
ru_ru: ; берем первый столбец x[,1] как rownames

source: ' is not a column of x
ru_ru: ' не столбец x

source: but should be nrow(x)==
ru_ru: , но должно быть nrow(x)==

source: When i is a matrix in DT[i]<-value syntax, it doesn't make sense to provide j
ru_ru: Когда i - матрица в DT[i]<-value синтаксисе, не имеет смысла задавать j

source: j must be an atomic vector, see ?is.atomic
ru_ru: j должен быть элементарным вектором, смотри ?is.atomic

source: NA in j
ru_ru: NA в j

source: j must be vector of column name or positions
ru_ru: j должен быть вектором с именами или с позициями столбцов

source: Attempt to assign to column position greater than ncol(x). Create the column by name, instead. This logic intends to catch (most likely) user errors.
ru_ru: Попытка присвоить значение столбцу с позицией больше, чем ncol(x). Вместо этого создайте колонку по имени. Эта логика предназначена для предотвращения наиболее вероятных пользовательских ошибок.

source: data.table inherits from data.frame (from v1.5), but this data.table does not. Has it been created manually (e.g. by using 'structure' rather than 'data.table') or saved to disk using a prior version of data.table?
ru_ru: data.table наследуется от data.frame (с версии v1.5), но этот data.table не такой. Он создан вручную (например, с использованием 'structure', а не 'data.table') или сохранен на диск с использованием предыдущей версии data.table?

source: attempting to assign invalid object to dimnames of a data.table
ru_ru: пытаемся присвоить неправильный объект названиям измерений data.table

source: data.tables do not have rownames
ru_ru: data.tables не содержит имен строк

source: Can't assign
ru_ru: Невозможно присвоить

source: colnames to a
ru_ru: имена столбцов таблице data.table с

source: -column data.table
ru_ru: столбцами

source: 'subset' must evaluate to logical
ru_ru: результат вычисления 'subset' должен иметь тип logical

source: Argument 'invert' must be logical TRUE/FALSE
ru_ru: Аргумент 'invert' должен быть логическим TRUE/FALSE

source: x argument must be a data.table
ru_ru: аргумент x должен быть таблицей data.table

source: group length is 0 but data nrow > 0
ru_ru: длина группы равна 0, но количество строк в данных > 0

source: passing 'f' argument together with 'by' is not allowed, use 'by' when split by column in data.table and 'f' when split by external factor
ru_ru: не допускается передача аргумента 'f' вместе с аргументом 'by', используйте 'by' при разделении по столбцу в таблице и 'f' при разделении по внешнему фактору

source: Either 'by' or 'f' argument must be supplied
ru_ru: Необходимо задать аргумент 'by' или 'f'

source: Column '.ll.tech.split' is reserved for split.data.table processing
ru_ru: Столбец '.ll.tech.split' зарезервирован для обработки split.data.table

source: Column '.nm.tech.split' is reserved for split.data.table processing
ru_ru: Столбец '.nm.tech.split' зарезервирован для обработки split.data.table

source: Argument 'by' must refer to column names in x
ru_ru: Аргумент 'by' должен ссылаться на имена столбцов в x

source: Argument 'by' must refer only to atomic-type columns, but the following columns are non-atomic:
ru_ru: Аргумент 'by' должен ссылаться только на столбцы атомарного типа, но следующие столбцы не являются атомарными:

source: x is not a data.table. Shallow copy is a copy of the vector of column pointers (only), so is only meaningful for data.table
ru_ru: x не является таблицей data.table. Поверхностная копия копирует только вектор указателей на столбцы и поэтому имеет смысл только для data.table

source: setalloccol attempting to modify `*tmp*`
ru_ru: попытка изменить `*tmp*` при помощи setalloccol

source: Input is a length=1 logical that points to the same address as R's global value. Therefore the attribute has not been set by reference, rather on a copy. You will need to assign the result back to a variable. See issue #1281.
ru_ru: Ввод является вектором типа logical единичной длины, ссылающимся на тот же адрес, что и значение в глобальном окружении R. Следовательно, атрибут был установлен не по ссылке, а при помощи создания копии. Вам нужно будет присвоить результат переменной. См. issue #1281.

source: x is not a data.table or data.frame
ru_ru: x не является таблицей data.table или data.frame

source: x has
ru_ru: x содержит

source: columns but its names are length
ru_ru: столбцов, но длина имен равна

source: Passed a vector of type '
ru_ru: Передан вектор типа '

source: '. Needs to be type 'character'.
ru_ru: '. Требуется вектор типа 'character'.

source: names to a
ru_ru: имен

source: column data.table
ru_ru: столбцу data.table

source: 'new' is not a character vector or a function
ru_ru: 'new' не является вектором типа character или функцией

source: NA in 'new' at positions
ru_ru: NA в 'new' в местах

source: Some duplicates exist in 'old':
ru_ru: В 'old' присутствуют дубликаты:

source: 'old' is type
ru_ru: 'old' имеет тип

source: but should be integer, double or character
ru_ru: но должен иметь тип integer, double или character

source: 'old' is length
ru_ru: 'old' имеет длину

source: but 'new' is length
ru_ru: но длина 'new' равна

source: NA (or out of bounds) in 'old' at positions
ru_ru: NA (или выход за границы объекта) в 'old' в местах

source: ' which appears several times in column names. Just the first will be changed. There are
ru_ru: `, который присутствует несколько раз в именах столбцов. Будет изменено только первое значение. Также есть

source: other items in old that are also duplicated in column names.
ru_ru: других значений в old, которые повторяются в именах столбцов.

source: Items of 'old' not found in column names:
ru_ru: Следующие значения из 'old' не найдены в именах столбцов:

source: . Consider skip_absent=TRUE.
ru_ru: . Вы можете использовать skip_absent=TRUE.

source: Internal error: length(i)!=length(new)
ru_ru: Внутренняя ошибка: length(i)!=length(new)

source: x has some duplicated column name(s):
ru_ru: x содержит повторы в именах столбцов:

source: . Please remove or rename the duplicate(s) and try again.
ru_ru: . Пожалуйста, удалите или переименуйте их и повторите попытку.

source: Input is
ru_ru: Ввод является

source: but should be a plain list of items to be stacked
ru_ru: но должен быть плоским списком значений, которые будут объединяться

source: idcol must be a logical or character vector of length 1. If logical TRUE the id column will named '.id'.
ru_ru: idcol должен быть вектором типа logical или character единичной длины. Если имеет логическое значение TRUE, столбец id будет назван '.id'.

source: use.names='check' cannot be used explicitly because the value 'check' is new in v1.12.2 and subject to change. It is just meant to convey default behavior. See ?rbindlist.
ru_ru: use.names='check' нельзя использовать в явном виде, поскольку значение 'check' впервые появилось в версии v1.12.2 и в дальнейшем будет меняться. Он просто предназначен для отображения поведения по умолчанию. См. ?rbindlist.

source: Check that is.data.table(DT) == TRUE. Otherwise, := and `:=`(...) are defined for use in j, once only and in particular ways. See help(":=").
ru_ru: Проверьте, выполняется ли условие is.data.table(DT) == TRUE. Если причина не в этом, то := и `:=`(...) предназначены для однократного использования в j, причем строго определенным образом. См. help(":=").

source: setDF only accepts data.table, data.frame or list of equal length as input
ru_ru: setDF принимает только таблицы data.table, data.frame или список с элементами равной длины

source: rownames contains duplicates
ru_ru: имена строк содержат повторяющиеся значения

source: rownames incorrect length; expected
ru_ru: имена строк имеют неправильную длину; ожидается

source: names, got
ru_ru: имен, задано

source: All elements in argument 'x' to 'setDF' must be of same length
ru_ru: Все элементы аргумента 'x' функции 'setDF' должны иметь равную длину

source: Cannot find symbol
ru_ru: Невозможно найти символ

source: Cannot convert '
ru_ru: Невозможно преобразовать '

source: ' resides within a package (or an environment) that is locked to prevent modifying its variable bindings. Try copying the object to your current environment, ex: var <- copy(var) and then using setDT again.
ru_ru: ' принадлежит пакету (или окружению), которое заблокировано для предотвращения изменения связывания его переменных. Попробуйте скопировать объект в ваше текущее окружение, например: var <- copy(var), а затем снова использовать setDT.

source: Some columns are a multi-column type (such as a matrix column):
ru_ru: Некоторые столбцы представляют собой мульти-столбцы (такие как столбец-матрица):

source: . setDT will retain these columns as-is but subsequent operations like grouping and joining may fail. Please consider as.data.table() instead which will create a new column for each embedded column.
ru_ru: . setDT сохранить эти столбцы как есть, но последующие операции, такие как группировка и объединение, могут не сработать. Пожалуйста, вместо этого рассмотрите возможность использования as.data.table() - эта функция создаст отдельный столбец для каждого из вложенных столбцов.

source: Column
ru_ru: Столбец

source: is of POSIXlt type. Please convert it to POSIXct using as.POSIXct and run setDT again. We do not recommend use of POSIXlt at all because it uses 40 bytes to store one date.
ru_ru: имеет тип POSIXlt. Пожалуйста, преобразуйте его в POSIXct при помощи as.POSIXct и запустите setDT снова. Мы не рекомендуем использовать POSIXlt, т.к. этот тип расходует 40 байт на хранение одной даты.

source: All elements in argument 'x' to 'setDT' must be of same length, but the profile of input lengths (length:frequency) is:
ru_ru: Все элементы аргумента 'x' функции 'setDT' должны иметь одинаковую длины, но распределение длины элементов (длина:частота) следующее:

source: The first entry with fewer than
ru_ru: Первой записью с менее чем

source: entries is
ru_ru: элементами является

source: Argument 'x' to 'setDT' should be a 'list', 'data.frame' or 'data.table'
ru_ru: Аргумент 'x' функции 'setDT' должен быть списком или таблицей 'data.frame'/'data.table'

source: Item '
ru_ru: Элемент '

source: ' not found in names of input list
ru_ru: ' не найден среди имен входного списка

source: 'prefix' must be NULL or a character vector of length 1.
ru_ru: 'prefix' должен представлять собой NULL или быть вектором типа character единичной длины.

source: x is a single vector, non-NULL 'cols' doesn't make sense.
ru_ru: x является отдельным вектором, непустое (non-NULL) значение 'cols' не имеет смысла.

source: x is a list, 'cols' cannot be 0-length.
ru_ru: x представляет собой список, 'cols' не может иметь нулевую длину.

source: RHS of %s is length %d which is not 1 or nrow (%d). For robustness, no recycling is allowed (other than of length 1 RHS). Consider %%in%% instead.
ru_ru: RHS %s имеет длину %d, которая не равна 1 или nrow (%d). Для более стабильной работы повторение (recycling) элементов не допускается (кроме случая, когда RHS имеет длину 1). Рассмотрите использование %%in%% вместо этого.

source: Internal error in .isFastSubsettable. Please report to data.table developers
ru_ru: Внутренняя ошибка в .isFastSubsettable. Просьба уведомить разработчиков

source: 'on' argument should be a named atomic vector of column names indicating which columns in 'i' should be joined with which columns in 'x'.
ru_ru: Аргумент 'on' должен быть именованным атомарным вектором имен столбцов, указывающим, какие столбцы в 'i' и 'x' должны объединяться.

source: Found more than one operator in one 'on' statement:
ru_ru: Обнаружен более чем один оператор в выражении 'on':

source: . Please specify a single operator.
ru_ru: . Пожалуйста, укажите один операторю

source: 'on' contains no column name:
ru_ru: 'on' не содержит имя столбца:

source: . Each 'on' clause must contain one or two column names.
ru_ru: . Каждый пункт в должен содержать одно или два имени столбцов.

source: 'on' contains more than 2 column names:
ru_ru: 'on' содержит более 2 имен столбцов:

source: Invalid operators
ru_ru: Недопустимые операторы

source: . Only allowed operators are
ru_ru: . Допустимыми операторами являются

source: There is no package %s in provided repository.
ru_ru: Пакет %s отсутствует в указанном репозитории.

source: 'fromLast' must be TRUE or FALSE
ru_ru: 'fromLast' должен иметь значение TRUE или FALSE

source: x must be an atomic vector or data.frames/data.tables
ru_ru: x должен быть атомарным вектором или таблицей data.frames/data.table

source: Using '
ru_ru: В качестве столбца значений используется '

source: ' as value column. Use 'value.var' to override
ru_ru: '. Используйте 'value.var', чтобы задать другой вариант

source: The dcast generic in data.table has been passed a
ru_ru: Генерической функции dcast пакета data.table был передан

source: , but data.table::dcast currently only has a method for data.tables. Please confirm your input is a data.table, with setDT(
ru_ru: , но data.table::dcast в настоящий момент содержит метод только для таблиц data.tables. Пожалуйста, подтвердите, что ваш объект имеет тип data.table, использовав setDT(

source: ) or as.data.table(
ru_ru: ) или as.data.table(

source: ). If you intend to use a reshape2::dcast, try installing that package first, but do note that reshape2 is deprecated and you should be migrating your code away from using it.
ru_ru: ). Если вы хотите использовать reshape2::dcast, сперва установите этот пакет, но помните, что reshape2 устарел; вам придется переписать свой код, чтобы избежать его использования.

source: and will attempt to redirect to the reshape2::dcast; please note that reshape2 is deprecated, and this redirection is now deprecated as well. Please do this redirection yourself like reshape2::dcast(
ru_ru: и будет осуществлена попытка переадресовать обработку функции reshape2::dcast; пожалуйста, обратите внимание, что пакет reshape2 устарел, также как и эта переадресация. Переадресовать можно вручную при помощи reshape2::dcast(

source: ). In the next version, this warning will become an error.
ru_ru: ). В следующей версии данное предупреждение станет сообщением об ошибке.

source: Invalid formula. Cast formula should be of the form LHS ~ RHS, for e.g., a + b ~ c.
ru_ru: Неправильная формула. Формула должна иметь вид LHS ~ RHS, например, a + b ~ c.

source: data.table to cast must have unique column names
ru_ru: таблица data.table, передаваемая функции cast, должна иметь уникальные имена столбцов

source: value.var values [
ru_ru: значения value.var [

source: ] are not found in 'data'.
ru_ru: ] не найдены в 'data'.

source: When 'fun.aggregate' and 'value.var' are both lists, 'value.var' must be either of length =1 or =length(fun.aggregate).
ru_ru: Когда и 'fun.aggregate', и 'value.var' являются списками, длина 'value.var' должна быть равна 1 или length(fun.aggregate).

source: 'data' must be a data.table.
ru_ru: 'data' должен быть таблицей data.table.

source: 'drop' must be logical TRUE/FALSE
ru_ru: 'drop' должен быть логическим TRUE/FALSE

source: Column [
ru_ru: Столбец [

source: ] not found or of unknown type.
ru_ru: ] не найден или имеет неизвестный тип.

source: Columns specified in formula can not be of type list
ru_ru: Используемые в формуле столбцы не могут иметь значения типа 'список'

source: Can not cast an empty data.table
ru_ru: Нельзя трансформировать пустую таблицу

source: Aggregate function missing, defaulting to 'length'
ru_ru: Агрегирующая функция не указана, по умолчанию используется 'length'

source: Internal error -- empty rhsnames in dcast; please report
ru_ru: Не указаны значения в правой части формулы в функции dcast()

source: The melt generic in data.table has been passed a
ru_ru: В функцию melt() был передан объект класса

source: , but data.table::melt currently only has a method for data.tables. Please confirm your input is a data.table, with setDT(
ru_ru: , однако data.table::melt на данный момент применима только к объектам класса data.table. Пожалуйста, убедитесь, что вы используете data.table-объект, для этого используйте setDT(

source: ). If you intend to use a method from reshape2, try installing that package first, but do note that reshape2 is deprecated and you should be migrating your code away from using it.
ru_ru: ). Если вы хотели использовать melt() пакета reshape2, дла начала установите его. Имейте в виду, что пакет reshape2 устарел и вам следует пересмотреть свой код, чтобы удалить ссылки на него.

source: and will attempt to redirect to the relevant reshape2 method; please note that reshape2 is deprecated, and this redirection is now deprecated as well. To continue using melt methods from reshape2 while both libraries are attached, e.g. melt.list, you can prepend the namespace like reshape2::melt(
ru_ru: , к которому будет применен соответствующий метод пакета reshape2. Имейте в виду, что пакет reshape2 устарел, так же как и подобный вызов его функций. Если вы хотите использовать melt() пакета reshape2, когда подключены и data.table, и reshape2, указывайте пакет явно, reshape2::melt(

source: Input patterns must be of type character.
ru_ru: Паттерн должен быть типа 'character'.

source: 'data' must be a data.table
ru_ru: Объект, переданный в аргумент 'data', должен быть класса data.table

source: 'value.name' provided in both 'measure.vars'
ru_ru: Столбец, указанный в 'value.name', одновременно используется в 'measure.vars'

source: and 'value.name argument'; value provided in
ru_ru: и в 'value.name';

source: 'measure.vars' is given precedence.
ru_ru: значение в 'measure.vars' приоритетнее.

source: Please provide a name to each element of 'measure.vars'.
ru_ru: Пожалуйста, укажите названия всех элементов 'measure.vars'.

source: y and x must both be data.tables. Use `setDT()` to convert list/data.frames to data.tables by reference or as.data.table() to convert to data.tables by copying.
ru_ru: Объекты, переданные в x и y оба должны быть класса data.table. Используйте `setDT()` для конвертации объекта на месте или as.data.table() для копирования и конвертации копии объекта.

source: maxgap must be a non-negative integer value of length 1
ru_ru: maxgap должен быть одним неотрицательным целым значением

source: minoverlap must be a positive integer value of length 1
ru_ru: minoverlap должен быть одним положительным целым значением

source: which must be a logical vector of length 1. Either TRUE/FALSE
ru_ru: which должен быть единичным логическим вектором. Или TRUE/FALSE

source: nomatch must either be NA or NULL
ru_ru: nomatch должен быть NA или NULL

source: maxgap and minoverlap arguments are not yet implemented.
ru_ru: аргументы maxgap и minoverlap еще не реализованы.

source: 'y' must be keyed (i.e., sorted, and, marked as sorted). Call setkey(y, ...) first, see ?setkey. Also check the examples in ?foverlaps.
ru_ru: обхъект в 'y' должен иметь ключи (отсортирован и промаркирован, что отсортирован). Для создания ключей используйте setkey(y, ...) детали в справке ?setkey. Также можете ознакомиться с примерами в справке ?foverlaps.

source: 'by.x' and 'by.y' should contain at least two column names (or numbers) each - corresponding to 'start' and 'end' points of intervals. Please see ?foverlaps and examples for more info.
ru_ru: в 'by.x' и 'by.y' необходимо указать как минимум по два столбца (или числа) для каждого, которые бы соответствовали точкам 'start' и 'end' интервалов. Для более подробной информации смотрите справку ?foverlaps и соответствующие примеры.

source: Invalid numeric value for 'by.x'; it should be a vector with values 1 <= by.x <= length(x)
ru_ru: Некорректное численное значение в 'by.x', оно должно быть вектором со значениями в интервале 1 <= by.x <= length(x)

source: Invalid numeric value for 'by.y'; it should be a vector with values 1 <= by.y <= length(y)
ru_ru: Некорректное численное значение в 'by.y', оно должно быть вектором со значениями в интервале 1 <= by.y <= length(y)

source: A non-empty vector of column names or numbers is required for by.x
ru_ru: В x необходимо указать непустой вектор названий столбцов или чисел.

source: A non-empty vector of column names or numbers is required for by.y
ru_ru: В y необходимо указать непустой вектор названий столбцов или чисел.

source: The first
ru_ru: Первые

source: columns of y's key must be identical to the columns specified in by.y.
ru_ru: столбцов ключа y должны быть идентичны указанным в by.y

source: Duplicate columns are not allowed in overlap joins. This may change in the future.
ru_ru: Дублирующиеся столбцы нельзя использовать в объединениях с пересечением (overlap joins). Это поведение может измениться в будущем.

source: length(by.x) != length(by.y). Columns specified in by.x should correspond to columns specified in by.y and should be of same lengths.
ru_ru: length(by.x) != length(by.y). Столбцы, указанные в by.x должны соответствовать указанным в by.y, кличество столбцов также должно быть одинаковым.

source: y has some duplicated column name(s):
ru_ru: в таблице y встречаются повторяющиеся названия столбцов:

source: The last two columns in by.x should correspond to the 'start' and 'end' intervals in data.table 'x' and must be integer/numeric type.
ru_ru: Последние два столбца в by.x должны соответствовать столбцам начала и конца интервалов в data.table-объекте 'x' и быть типа integer или numeric.

source: NA values in data.table 'x' start column: '
ru_ru: В data.table-таблице 'x' встречаются NA-значения в начале столбца:

source: '. All rows with NA values in the range columns must be removed for foverlaps() to work.
ru_ru: '. Для корректной работы foverlaps() все строки с NA в столбцах интервалов должны быть удалены.

source: NA values in data.table 'x' end column: '
ru_ru: NA-значения встречаются в data.table-таблице 'x' в конце столбца:

source: All entries in column
ru_ru: Все значения в столбце
